SOAP/Fedex Sample code/Fedex Sample code/Advance/FDX_WS_AdvancedServices_PHP_v2014/WS_AdvanvedServicesWSDLs_v2014/PickupService_WSDL/PickupTransactions/PickupAvailability_GlobalRequest.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://fedex.com/ws/pickup/v9">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:PickupAvailabilityRequest>
        <v9:WebAuthenticationDetail>
         <v9:UserCredential>
               <v9:Key>Input Your Information</v9:Key>
               <v9:Password>Input Your Information </v9:Password>
            </v9:UserCredential>
         </v9:WebAuthenticationDetail>
         <v9:ClientDetail>
            <v9:AccountNumber>Input Your Information</v9:AccountNumber>
            <v9:MeterNumber>Input Your Information</v9:MeterNumber>
            <v9:Localization>
               <v9:LanguageCode>EN</v9:LanguageCode>
               <v9:LocaleCode>EN</v9:LocaleCode>
            </v9:Localization>
         </v9:ClientDetail>
         <v9:TransactionDetail>
            <v9:CustomerTransactionId>PickupAvailabilityRequest_v9</v9:CustomerTransactionId>
            <v9:Localization>
               <v9:LanguageCode>EN</v9:LanguageCode>
               <v9:LocaleCode>EN</v9:LocaleCode>
            </v9:Localization>
         </v9:TransactionDetail>
         <v9:Version>
            <v9:ServiceId>disp</v9:ServiceId>
            <v9:Major>9</v9:Major>
            <v9:Intermediate>0</v9:Intermediate>
            <v9:Minor>0</v9:Minor>
         </v9:Version>
         <v9:PickupAddress>
            <v9:StreetLines>Input Your Information</v9:StreetLines>
            <v9:City>Input Your Information</v9:City>
            <v9:StateOrProvinceCode>Input Your Information</v9:StateOrProvinceCode>
            <v9:PostalCode>Input Your Information</v9:PostalCode>
            <v9:CountryCode>Input Your Information</v9:CountryCode>
            <v9:Residential>Input Your Information</v9:Residential>
         </v9:PickupAddress>
         <v9:PickupRequestType>Input Your Information</v9:PickupRequestType>
         <v9:DispatchDate>Input Your Information</v9:DispatchDate>
         <v9:NumberOfBusinessDays>3</v9:NumberOfBusinessDays>
         <v9:PackageReadyTime>15:00:00</v9:PackageReadyTime>
         <v9:CustomerCloseTime>19:00:00</v9:CustomerCloseTime>
         <v9:Carriers>FDXE</v9:Carriers>
         <v9:ShipmentAttributes>
            <v9:ServiceType>PRIORITY_OVERNIGHT</v9:ServiceType>
            <v9:PackagingType>YOUR_PACKAGING</v9:PackagingType>
            <v9:Dimensions>
               <v9:Length>12</v9:Length>
               <v9:Width>12</v9:Width>
               <v9:Height>12</v9:Height>
               <v9:Units>IN</v9:Units>
            </v9:Dimensions>
            <v9:Weight>
               <v9:Units>LB</v9:Units>
               <v9:Value>150.0</v9:Value>
            </v9:Weight>
         </v9:ShipmentAttributes>
      </v9:PickupAvailabilityRequest>
   </soapenv:Body>
</soapenv:Envelope>